{
  "loan_process": {
    "overview": "Getting an education loan through our platform is simple, fast, and completely digital. Here's how it works:",
    "steps": [
      {
        "step": 1,
        "title": "Create Your Account",
        "description": "Sign up with your email and basic details. Takes just 2 minutes.",
        "duration": "2 minutes"
      },
      {
        "step": 2,
        "title": "Complete Your Profile",
        "description": "Fill in your academic background, admission details, and financial information. Our smart forms make this easy.",
        "duration": "15-20 minutes",
        "what_you_need": ["Academic records", "Admission letter", "Personal information"]
      },
      {
        "step": 3,
        "title": "Upload Documents",
        "description": "Upload required documents like mark sheets, admission letter, KYC documents, and financial proofs.",
        "duration": "10-15 minutes",
        "tip": "Keep all documents ready as PDFs or JPGs before starting"
      },
      {
        "step": 4,
        "title": "AI Analysis & Matching",
        "description": "Our AI instantly analyzes your profile and matches you with the best NBFCs for your situation.",
        "duration": "Instant",
        "what_happens": "We evaluate 50+ factors including academic performance, university ranking, course type, financial background, and co-borrower strength"
      },
      {
        "step": 5,
        "title": "Review Matches & Apply",
        "description": "Review your NBFC matches with loan details and interest rates. Submit to your preferred lenders.",
        "duration": "5-10 minutes",
        "tip": "You can apply to multiple NBFCs to maximize approval chances"
      },
      {
        "step": 6,
        "title": "NBFC Review",
        "description": "NBFCs review your application, may request additional documents or schedule interviews.",
        "duration": "3-10 business days",
        "what_to_expect": "You'll get notifications for any updates or document requests"
      },
      {
        "step": 7,
        "title": "Loan Approval & Disbursement",
        "description": "Once approved, complete final formalities and get your loan disbursed directly to your university.",
        "duration": "2-5 business days after approval"
      }
    ],
    "total_timeline": "Most students complete the application in under 1 hour and receive loan approval within 7-14 days"
  },

  "documents_required": {
    "why_we_need_documents": "Documents help us verify your identity, assess your eligibility, and match you with the right lenders. Complete documentation increases approval chances by 60%.",
    
    "categories": {
      "academic_documents": {
        "documents": [
          "10th Standard Mark Sheet",
          "12th Standard Mark Sheet",
          "Bachelor's Degree Certificate & Transcripts (if applicable)",
          "Master's Degree Certificate & Transcripts (if applicable)",
          "Entrance Exam Scores (GRE/GMAT/SAT/ACT if applicable)"
        ],
        "why_needed": "Academic documents prove your educational background and help NBFCs assess your credibility. Strong academic performance can get you better interest rates.",
        "format": "PDF or clear scanned images",
        "tips": [
          "Ensure all pages are legible",
          "Include provisional certificates if final ones are pending",
          "Translate non-English documents"
        ]
      },
      
      "admission_documents": {
        "documents": [
          "Admission Letter / Offer Letter from University",
          "I-20 (USA) / CAS (UK) / COE (Australia)",
          "Course Fee Breakdown",
          "Visa Copy (if already obtained)"
        ],
        "why_needed": "Admission documents confirm you've been accepted to a university and help determine the exact loan amount required. NBFCs only fund students with valid admissions.",
        "format": "PDF - must be official documents from university",
        "tips": [
          "Unconditional offer letters are preferred",
          "Include detailed fee breakdown showing tuition, living costs, etc.",
          "If conditional offer, show proof of meeting conditions"
        ]
      },
      
      "kyc_documents": {
        "documents": [
          "Aadhaar Card (mandatory)",
          "PAN Card (mandatory)",
          "Passport (mandatory for international study)",
          "Current Address Proof (utility bill/bank statement)",
          "Passport Size Photographs"
        ],
        "why_needed": "KYC documents are legally required for loan applications. They verify your identity and comply with RBI regulations. Without complete KYC, your application cannot be processed.",
        "format": "Clear colored scans or photos",
        "tips": [
          "Ensure Aadhaar and PAN are linked",
          "Address on documents should match current residence",
          "Passport must be valid for at least 2 years"
        ]
      },
      
      "financial_documents": {
        "documents": [
          "Last 6 months Bank Statements",
          "Income Proof (Salary Slips / ITR)",
          "Form 16 (if applicable)",
          "Property Documents (if using as collateral)",
          "Fixed Deposit Statements",
          "Business Proof (if self-employed)"
        ],
        "why_needed": "Financial documents help NBFCs assess your family's repayment capacity. Strong financial background can help you get loans without collateral or at better interest rates.",
        "format": "Bank statements: PDF from bank portal. Other docs: PDF or scanned",
        "tips": [
          "Show consistent income and healthy bank balance",
          "Include all income sources",
          "Property docs significantly improve approval chances",
          "Don't hide loans - declare existing liabilities honestly"
        ]
      },
      
      "coborrower_documents": {
        "documents": [
          "Co-borrower KYC (Aadhaar, PAN, Address Proof)",
          "Co-borrower Bank Statements (6 months)",
          "Co-borrower Income Proof",
          "Co-borrower ITR / Form 16",
          "Relationship Proof (if not parent)"
        ],
        "why_needed": "Most education loans require a co-borrower (usually parents/guardians) who guarantees loan repayment. Co-borrower's financial strength is crucial for approval.",
        "who_can_be_coborrower": [
          "Parents (most preferred)",
          "Spouse",
          "Siblings",
          "Blood relatives with strong financial background"
        ],
        "tips": [
          "Co-borrower should have stable income",
          "Better co-borrower profile = better loan terms",
          "Some NBFCs allow 2 co-borrowers for large loans"
        ]
      }
    },
    
    "common_questions": [
      {
        "q": "What if I don't have all documents?",
        "a": "Start your application with available documents. Our system will guide you on missing items. You can upload documents progressively."
      },
      {
        "q": "Do I need property for collateral?",
        "a": "Not always! Loans up to ₹7.5 lakhs are often collateral-free. For higher amounts, requirements vary by NBFC. Our AI will match you with suitable lenders based on your collateral availability."
      },
      {
        "q": "Can I apply if my parents are self-employed?",
        "a": "Yes! Self-employed parents need to provide ITR, business proof, and bank statements. Many NBFCs work with self-employed co-borrowers."
      }
    ]
  },

  "eligibility": {
    "basic_requirements": [
      "Indian citizen (holding valid Indian passport)",
      "Admission to a recognized foreign university",
      "Co-borrower with stable income",
      "Age: 18-35 years (student)",
      "Course: Must be career-oriented (degree/diploma programs)"
    ],
    
    "factors_affecting_approval": {
      "positive_factors": [
        "Strong academic record (above 60% in previous degrees)",
        "Admission to top-ranked universities (QS Top 500)",
        "STEM courses or high-ROI programs",
        "Co-borrower with stable income (₹5+ lakhs annual)",
        "Collateral availability",
        "Good credit history (if any)",
        "Scholarships or assistantships"
      ],
      "negative_factors": [
        "Poor academic record (multiple backlogs, low grades)",
        "Universities with poor reputation",
        "Courses with unclear job prospects",
        "Co-borrower with unstable income",
        "Existing loan defaults",
        "Incomplete application"
      ]
    },
    
    "loan_amount_range": "₹10 lakhs to ₹1 crore depending on course fees, university, and your financial profile",
    
    "typical_approval_rates": {
      "excellent_profile": "95% approval (Top university + strong financials + collateral)",
      "good_profile": "80% approval (Good university + decent financials)",
      "average_profile": "60% approval (Average university + modest financials)",
      "weak_profile": "30% approval (Low-ranked university + weak financials)"
    }
  },

  "loan_terms": {
    "interest_rates": "9.5% to 15% per annum depending on NBFC, loan amount, and your profile. Better profiles get lower rates.",
    "repayment_period": "7 to 15 years typically. Longer tenure available for higher loan amounts.",
    "moratorium_period": "Course duration + 6 months to 1 year. You start repaying only after completing your course and finding a job.",
    "processing_fees": "1% to 3% of loan amount (varies by NBFC)",
    "collateral": "Required for loans above ₹7.5 lakhs in most cases. Can be property, FDs, LIC policies, etc."
  },

  "nbfc_information": {
    "what_is_nbfc": "NBFC (Non-Banking Financial Company) is a company licensed by RBI to provide banking services without holding a banking license. NBFCs specialize in education loans and often have better approval rates than traditional banks.",
    
    "our_partners": "We partner with 10+ leading NBFCs including specialized education loan providers. Each has different eligibility criteria, interest rates, and approval processes.",
    
    "why_multiple_nbfcs": "Different NBFCs prefer different student profiles. Some focus on top universities, others on mid-tier. Some prefer collateral loans, others offer collateral-free. Our AI finds the best matches for YOUR specific situation.",
    
    "how_matching_works_general": "We analyze your academic profile, university ranking, financial background, and co-borrower strength. Then we match you with NBFCs that have approved similar profiles historically. We DON'T reveal the exact algorithm to protect our intellectual property.",
    
    "can_apply_to_multiple": "Yes! You can apply to 2-3 matched NBFCs simultaneously to maximize approval chances. This doesn't affect your credit score."
  },

  "common_faqs": [
    {
      "q": "How long does the entire process take?",
      "a": "Application completion: 30-60 minutes. NBFC review: 3-10 business days. Approval to disbursement: 2-5 days. Total: 1-3 weeks typically."
    },
    {
      "q": "Can I track my application status?",
      "a": "Yes! Real-time tracking available in your dashboard. You'll also receive email/SMS notifications for every status update."
    },
    {
      "q": "What if I get rejected by one NBFC?",
      "a": "You can apply to other matched NBFCs. Rejection by one doesn't affect your chances with others. Our consultants can also help improve your application."
    },
    {
      "q": "Do you charge students any fees?",
      "a": "Our platform is FREE for students. You only pay processing fees to the NBFC if your loan is approved (1-3% of loan amount)."
    },
    {
      "q": "Can I get a loan without collateral?",
      "a": "Yes, for loans up to ₹7.5 lakhs. Above that, collateral requirements vary by NBFC. Some may approve without collateral if you have strong academic and financial profile."
    },
    {
      "q": "What happens if I don't get a visa?",
      "a": "Most NBFCs allow loan cancellation if visa is rejected. Check specific NBFC policies during application."
    },
    {
      "q": "When does loan repayment start?",
      "a": "After course completion + 6-12 months moratorium (grace period). You don't pay during your studies."
    }
  ],

  "tips_for_success": [
    "Start your application early - at least 2-3 months before visa application",
    "Ensure all documents are complete and clear before uploading",
    "Maintain good communication with your assigned consultant",
    "Apply to 2-3 matched NBFCs to maximize approval chances",
    "Be honest in your application - false information leads to rejection",
    "Keep your contact details updated for quick communication",
    "Respond promptly to document requests from NBFCs"
  ]
}
